package page1;

public class ValidSudoku {
	public static void main(String[] args) {
		System.out.println(isValidSudoku(new char[][] {			
			  {'5','3','.','.','7','.','.','.','.'},
			  {'6','.','.','1','9','5','.','.','.'},
			  {'.','9','8','.','.','.','.','6','.'},
			  {'8','.','.','.','6','.','.','.','3'},
			  {'4','.','.','8','.','3','.','.','1'},
			  {'7','.','.','.','2','.','.','.','6'},
			  {'.','6','.','.','.','.','2','8','.'},
			  {'.','.','.','4','1','9','.','.','5'},
			  {'.','.','.','.','8','.','.','7','9'}
		}));

	}

	public static boolean isValidSudoku(char[][] board) {
		// 흐으으으음
		//구역 나눠서 확인하는것과 가로세로 확인하는것을 만들어야되나...? 이중포문..?

		return true;

	}

}
